==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [128, 1]                  --
├─Linear: 1-1                            [128, 32]                 448
├─BatchNorm1d: 1-2                       [128, 32]                 64
├─ReLU: 1-3                              [128, 32]                 --
├─Dropout: 1-4                           [128, 32]                 --
├─Linear: 1-5                            [128, 1]                  33
==========================================================================================
Total params: 545
Trainable params: 545
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.07
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.07
Params size (MB): 0.00
Estimated Total Size (MB): 0.08
==========================================================================================