==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTMModel                                [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 16]             1,216
├─LayerNorm: 1-2                         [128, 13, 16]             32
├─Dropout: 1-3                           [128, 13, 16]             --
├─Linear: 1-4                            [128, 1]                  17
==========================================================================================
Total params: 1,265
Trainable params: 1,265
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 2.03
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.43
Params size (MB): 0.01
Estimated Total Size (MB): 0.44
==========================================================================================