==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTMModel                              [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 64]             8,960
├─LayerNorm: 1-2                         [128, 13, 64]             128
├─Dropout: 1-3                           [128, 13, 64]             --
├─Linear: 1-4                            [128, 1]                  65
==========================================================================================
Total params: 9,153
Trainable params: 9,153
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 14.93
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 1.70
Params size (MB): 0.04
Estimated Total Size (MB): 1.75
==========================================================================================