==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ImprovedBinaryCNN                        [128, 1]                  24,838
├─Sequential: 1-1                        [128, 16, 13]             --
│    └─Conv1d: 2-1                       [128, 16, 13]             48
│    └─BatchNorm1d: 2-2                  [128, 16, 13]             32
│    └─GELU: 2-3                         [128, 16, 13]             --
├─ResidualBlock: 1-2                     [128, 16, 13]             --
│    └─Sequential: 2-4                   [128, 16, 13]             --
│    │    └─Conv1d: 3-1                  [128, 16, 13]             768
│    │    └─BatchNorm1d: 3-2             [128, 16, 13]             32
│    │    └─GELU: 3-3                    [128, 16, 13]             --
│    │    └─Conv1d: 3-4                  [128, 16, 13]             768
│    │    └─BatchNorm1d: 3-5             [128, 16, 13]             32
│    └─Identity: 2-5                     [128, 16, 13]             --
│    └─GELU: 2-6                         [128, 16, 13]             --
├─Sequential: 1-3                        [128, 32, 6]              --
│    └─Conv1d: 2-7                       [128, 32, 13]             1,536
│    └─BatchNorm1d: 2-8                  [128, 32, 13]             64
│    └─GELU: 2-9                         [128, 32, 13]             --
│    └─MaxPool1d: 2-10                   [128, 32, 6]              --
│    └─Dropout: 2-11                     [128, 32, 6]              --
├─ResidualBlock: 1-4                     [128, 32, 6]              --
│    └─Sequential: 2-12                  [128, 32, 6]              --
│    │    └─Conv1d: 3-6                  [128, 32, 6]              3,072
│    │    └─BatchNorm1d: 3-7             [128, 32, 6]              64
│    │    └─GELU: 3-8                    [128, 32, 6]              --
│    │    └─Conv1d: 3-9                  [128, 32, 6]              3,072
│    │    └─BatchNorm1d: 3-10            [128, 32, 6]              64
│    └─Identity: 2-13                    [128, 32, 6]              --
│    └─GELU: 2-14                        [128, 32, 6]              --
├─Sequential: 1-5                        [128, 64, 3]              --
│    └─Conv1d: 2-15                      [128, 64, 6]              6,144
│    └─BatchNorm1d: 2-16                 [128, 64, 6]              128
│    └─GELU: 2-17                        [128, 64, 6]              --
│    └─MaxPool1d: 2-18                   [128, 64, 3]              --
│    └─Dropout: 2-19                     [128, 64, 3]              --
├─ResidualBlock: 1-6                     [128, 64, 3]              --
│    └─Sequential: 2-20                  [128, 64, 3]              --
│    │    └─Conv1d: 3-11                 [128, 64, 3]              12,288
│    │    └─BatchNorm1d: 3-12            [128, 64, 3]              128
│    │    └─GELU: 3-13                   [128, 64, 3]              --
│    │    └─Conv1d: 3-14                 [128, 64, 3]              12,288
│    │    └─BatchNorm1d: 3-15            [128, 64, 3]              128
│    └─Identity: 2-21                    [128, 64, 3]              --
│    └─GELU: 2-22                        [128, 64, 3]              --
├─SpatialAttention: 1-7                  [128, 64, 3]              --
│    └─Conv1d: 2-23                      [128, 1, 3]               14
│    └─Sigmoid: 2-24                     [128, 1, 3]               --
├─Sequential: 1-8                        [128, 1]                  --
│    └─Linear: 2-25                      [128, 64]                 12,288
│    └─BatchNorm1d: 2-26                 [128, 64]                 128
│    └─GELU: 2-27                        [128, 64]                 --
│    └─Dropout: 2-28                     [128, 64]                 --
│    └─Linear: 2-29                      [128, 1]                  65
==========================================================================================
Total params: 77,989
Trainable params: 77,989
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 25.76
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 4.62
Params size (MB): 0.21
Estimated Total Size (MB): 4.84
==========================================================================================