==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTMModel                              [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 256]            134,144
├─LayerNorm: 1-2                         [128, 13, 256]            512
├─Dropout: 1-3                           [128, 13, 256]            --
├─Linear: 1-4                            [128, 1]                  257
==========================================================================================
Total params: 134,913
Trainable params: 134,913
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 223.31
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 6.82
Params size (MB): 0.54
Estimated Total Size (MB): 7.36
==========================================================================================