==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
TransformerModel                         [128, 1]                  --
├─Linear: 1-1                            [128, 13, 16]             32
├─ModuleList: 1-2                        --                        --
│    └─TransformerBlock: 2-1             [128, 13, 16]             --
│    │    └─MultiHeadAttention: 3-1      [128, 13, 16]             1,120
│    │    └─FFN: 3-2                     [128, 13, 16]             8,496
│    └─TransformerBlock: 2-2             [128, 13, 16]             --
│    │    └─MultiHeadAttention: 3-3      [128, 13, 16]             1,120
│    │    └─FFN: 3-4                     [128, 13, 16]             8,496
│    └─TransformerBlock: 2-3             [128, 13, 16]             --
│    │    └─MultiHeadAttention: 3-5      [128, 13, 16]             1,120
│    │    └─FFN: 3-6                     [128, 13, 16]             8,496
│    └─TransformerBlock: 2-4             [128, 13, 16]             --
│    │    └─MultiHeadAttention: 3-7      [128, 13, 16]             1,120
│    │    └─FFN: 3-8                     [128, 13, 16]             8,496
├─Linear: 1-3                            [128, 1]                  209
==========================================================================================
Total params: 38,705
Trainable params: 38,705
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 4.95
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 19.81
Params size (MB): 0.15
Estimated Total Size (MB): 19.97
==========================================================================================