==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [128, 1]                  --
├─Linear: 1-1                            [128, 128]                1,792
├─BatchNorm1d: 1-2                       [128, 128]                256
├─ReLU: 1-3                              [128, 128]                --
├─Dropout: 1-4                           [128, 128]                --
├─Linear: 1-5                            [128, 1]                  129
==========================================================================================
Total params: 2,177
Trainable params: 2,177
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.28
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.26
Params size (MB): 0.01
Estimated Total Size (MB): 0.28
==========================================================================================