==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [128, 1]                  --
├─Linear: 1-1                            [128, 16]                 224
├─BatchNorm1d: 1-2                       [128, 16]                 32
├─ReLU: 1-3                              [128, 16]                 --
├─Dropout: 1-4                           [128, 16]                 --
├─Linear: 1-5                            [128, 1]                  17
==========================================================================================
Total params: 273
Trainable params: 273
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.03
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.03
Params size (MB): 0.00
Estimated Total Size (MB): 0.04
==========================================================================================