==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNNModel                                 [128, 1]                  --
├─Conv1d: 1-1                            [128, 64, 11]             256
├─MaxPool1d: 1-2                         [128, 64, 5]              --
├─Dropout: 1-3                           [128, 64, 5]              --
├─Conv1d: 1-4                            [128, 128, 3]             24,704
├─MaxPool1d: 1-5                         [128, 128, 1]             --
├─Dropout: 1-6                           [128, 128, 1]             --
├─Linear: 1-7                            [128, 128]                16,512
├─Dropout: 1-8                           [128, 128]                --
├─Linear: 1-9                            [128, 1]                  129
==========================================================================================
Total params: 41,601
Trainable params: 41,601
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 11.98
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 1.25
Params size (MB): 0.17
Estimated Total Size (MB): 1.42
==========================================================================================