==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [128, 1]                  --
├─Linear: 1-1                            [128, 64]                 896
├─BatchNorm1d: 1-2                       [128, 64]                 128
├─ReLU: 1-3                              [128, 64]                 --
├─Dropout: 1-4                           [128, 64]                 --
├─Linear: 1-5                            [128, 1]                  65
==========================================================================================
Total params: 1,089
Trainable params: 1,089
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.14
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.13
Params size (MB): 0.00
Estimated Total Size (MB): 0.14
==========================================================================================