==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
BiLSTMModel                              [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 32]             2,432
├─LayerNorm: 1-2                         [128, 13, 32]             64
├─Dropout: 1-3                           [128, 13, 32]             --
├─Linear: 1-4                            [128, 1]                  33
==========================================================================================
Total params: 2,529
Trainable params: 2,529
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 4.06
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.85
Params size (MB): 0.01
Estimated Total Size (MB): 0.87
==========================================================================================