==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTMModel                                [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 128]            67,072
├─LayerNorm: 1-2                         [128, 13, 128]            256
├─Dropout: 1-3                           [128, 13, 128]            --
├─Linear: 1-4                            [128, 1]                  129
==========================================================================================
Total params: 67,457
Trainable params: 67,457
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 111.66
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 3.41
Params size (MB): 0.27
Estimated Total Size (MB): 3.69
==========================================================================================