==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
LSTMModel                                [128, 1]                  --
├─LSTM: 1-1                              [128, 13, 64]             17,152
├─LayerNorm: 1-2                         [128, 13, 64]             128
├─Dropout: 1-3                           [128, 13, 64]             --
├─Linear: 1-4                            [128, 1]                  65
==========================================================================================
Total params: 17,345
Trainable params: 17,345
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 28.57
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 1.70
Params size (MB): 0.07
Estimated Total Size (MB): 1.78
==========================================================================================