==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ImprovedBinaryCNN                        [128, 1]                  6
├─Sequential: 1-1                        [128, 32, 13]             --
│    └─Conv1d: 2-1                       [128, 32, 13]             96
│    └─BatchNorm1d: 2-2                  [128, 32, 13]             64
│    └─GELU: 2-3                         [128, 32, 13]             --
├─ResidualBlock: 1-2                     [128, 32, 13]             --
│    └─Sequential: 2-4                   [128, 32, 13]             --
│    │    └─Conv1d: 3-1                  [128, 32, 13]             3,072
│    │    └─BatchNorm1d: 3-2             [128, 32, 13]             64
│    │    └─GELU: 3-3                    [128, 32, 13]             --
│    │    └─Conv1d: 3-4                  [128, 32, 13]             3,072
│    │    └─BatchNorm1d: 3-5             [128, 32, 13]             64
│    └─Identity: 2-5                     [128, 32, 13]             --
│    └─GELU: 2-6                         [128, 32, 13]             --
├─Sequential: 1-3                        [128, 32, 6]              --
│    └─Conv1d: 2-7                       [128, 32, 13]             3,072
│    └─BatchNorm1d: 2-8                  [128, 32, 13]             64
│    └─GELU: 2-9                         [128, 32, 13]             --
│    └─MaxPool1d: 2-10                   [128, 32, 6]              --
│    └─Dropout: 2-11                     [128, 32, 6]              --
├─ResidualBlock: 1-4                     [128, 32, 6]              --
│    └─Sequential: 2-12                  [128, 32, 6]              --
│    │    └─Conv1d: 3-6                  [128, 32, 6]              3,072
│    │    └─BatchNorm1d: 3-7             [128, 32, 6]              64
│    │    └─GELU: 3-8                    [128, 32, 6]              --
│    │    └─Conv1d: 3-9                  [128, 32, 6]              3,072
│    │    └─BatchNorm1d: 3-10            [128, 32, 6]              64
│    └─Identity: 2-13                    [128, 32, 6]              --
│    └─GELU: 2-14                        [128, 32, 6]              --
├─Sequential: 1-5                        [128, 64, 3]              --
│    └─Conv1d: 2-15                      [128, 64, 6]              6,144
│    └─BatchNorm1d: 2-16                 [128, 64, 6]              128
│    └─GELU: 2-17                        [128, 64, 6]              --
│    └─MaxPool1d: 2-18                   [128, 64, 3]              --
│    └─Dropout: 2-19                     [128, 64, 3]              --
├─ResidualBlock: 1-6                     [128, 64, 3]              --
│    └─Sequential: 2-20                  [128, 64, 3]              --
│    │    └─Conv1d: 3-11                 [128, 64, 3]              12,288
│    │    └─BatchNorm1d: 3-12            [128, 64, 3]              128
│    │    └─GELU: 3-13                   [128, 64, 3]              --
│    │    └─Conv1d: 3-14                 [128, 64, 3]              12,288
│    │    └─BatchNorm1d: 3-15            [128, 64, 3]              128
│    └─Identity: 2-21                    [128, 64, 3]              --
│    └─GELU: 2-22                        [128, 64, 3]              --
├─Sequential: 1-7                        [128, 128, 1]             --
│    └─Conv1d: 2-23                      [128, 128, 3]             24,576
│    └─BatchNorm1d: 2-24                 [128, 128, 3]             256
│    └─GELU: 2-25                        [128, 128, 3]             --
│    └─MaxPool1d: 2-26                   [128, 128, 1]             --
│    └─Dropout: 2-27                     [128, 128, 1]             --
├─SpatialAttention: 1-8                  [128, 128, 1]             --
│    └─Conv1d: 2-28                      [128, 1, 1]               14
│    └─Sigmoid: 2-29                     [128, 1, 1]               --
├─Sequential: 1-9                        [128, 1]                  --
│    └─Linear: 2-30                      [128, 64]                 8,192
│    └─BatchNorm1d: 2-31                 [128, 64]                 128
│    └─GELU: 2-32                        [128, 64]                 --
│    └─Dropout: 2-33                     [128, 64]                 --
│    └─Linear: 2-34                      [128, 1]                  65
==========================================================================================
Total params: 80,181
Trainable params: 80,181
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 45.01
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 6.69
Params size (MB): 0.32
Estimated Total Size (MB): 7.01
==========================================================================================